product_id	28510
app_id	28510
tenant_id	28510
item_id	28510
product_id_type	28510
_id	28510
_routing	28510
product_type	28509
category	28504
product_type_group	28458
is_product_type_validated	28445
brand	27826
product_short_description	27269
supplier_id	27042
contains_batteries	26124
manufacturer	25002
is_product_short_description_validated	24345
is_product_name_validated	24341
is_brand_validated	24340
is_prop_65_warning_required	23980
model	22700
correct_product_type	21690
prop_65_warning_text	19537
product_long_description	19474
is_private_label	19407
ib_category	19364
priority	19281
ib_sub_category	19160
contains_chemicals	19087
contained_battery_type	18444
is_category_validated	18339
is_manufacturer_validated	18317
wpid	17811
supplier_name	17674
is_contains_batteries_validated	17539
is_prop_65_warning_required_validated	17512
is_contained_battery_type_validated	17512
is_prop_65_warning_text_validated	17509
correct_category	16401
is_occasion_validated	15772
occasion	15542
manufacturer_part_number	14581
active_status	12745
product_long_description_validation_comment	12148
is_product_long_description_validated	10929
product_short_description_validation_comment	10892
is_has_warranty_validated	10463
is_warranty_text_validated	10129
color	10099
error_codes	10049
supplier_country_code	10030
is_assembled_product_dimensions_validated	9771
is_sports_league_validated	9667
is_sports_team_validated	9667
assembled_product_dimensions	9498
is_color_validated	9474
brand_validation_comment	9439
num_attributes_passed	9113
num_attributes_failed	9113
pass_or_failed_validation	9113
abort	9113
no	9113
num_attributes_aborted	9113
total	9113
pass_fail	9113
total_errors	9113
yes	9113
category_error_code	8557
product_short_description_error_code	8290
is_warranty_url_validated	7800
has_warranty	7513
manufacturer_error_code	7036
product_name_validation_comment	6999
warranty_text	6332
product_long_description_error_code	5445
product_type_validation_comment	5427
prop_65_warning	4777
warranty_text_error_code	4501
warranty_url_error_code	4487
has_warranty_error_code	4450
assembled_product_length	4187
compatible_devices	4098
assembled_product_width	4037
assembled_product_height	3901
is_assembled_product_width_validated	3363
is_assembled_product_height_validated	3362
is_assembled_product_length_validated	3355
is_personalizable_validated	3194
is_personalization_url_validated	3153
is_compatible_devices_validated	2944
color_category	2495
screen_size	2417
hard_drive_capacity	2411
is_color_category_validated	2353
category_validation_comment	1969
is_hard_drive_capacity_validated	1952
display_technology	1779
product_type_error_code	1754
is_portable	1739
assembled_product_height_error_code	1609
assembled_product_width_error_code	1609
color_error_code	1599
assembled_product_length_error_code	1548
ram_memory	1504
wireless	1433
video_game_platform	1403
operating_system	1388
is_screen_size_validated	1356
product_name_error_code	1329
processor_type	1308
is_cell_phone_case_type_validated	1282
cell_phone_case_type	1158
is_smart_validated	1121
is_ram_memory_validated	1103
is_smart	1088
is_portable_validated	1060
is_processor_type_validated	1053
is_operating_system_validated	1025
resolution	999
manufacturer_validation_comment	961
cell_phone_service_provider	905
brand_error_code	863
is_cell_phone_type_validated	825
is_cell_phone_service_provider_validated	815
is_energy_guide_label_required_validated	802
cell_phone_type	781
is_energy_guide_label_validated	763
personalizable	704
is_wireless_validated	692
is_contains_chemicals_validated	674
is_compatible_smart_control_systems_validated	669
desktop_computer_type	641
is_desktop_computer_type_validated	633
compatible_smart_control_systems_error_code	630
prop_65_warning_text_error_code	626
memory_capacity	610
screen_size_error_code	605
is_prop_65_warning_required_error_code	583
condition	459
is_condition_validated	447
is_inputs_and_outputs_validated	442
memory_card_type	424
wireless_technology	407
inputs_and_outputs	396
is_wireless_technology_validated	396
ram_memory_type	388
is_display_technology_validated	368
is_power_type_validated	363
power_type	360
is_resolution_validated	351
headphone_type	338
hard_drive_type	335
internal_external	332
is_model_name_validated	320
laptop_computer_type	315
is_accessories_included_validated	315
television_type	314
maximum_screen_size	311
is_energy_guide_label_required	280
processor_type_error_code	280
is_video_game_platform_validated	272
color_validation_comment	271
is_headphone_type_validated	267
product_secondary_image_url_error_code	263
is_waterproof	253
is_television_type_validated	252
model_name_error_code	247
is_smart_error_code	244
occasion_validation_comment	238
features	220
is_computer_cable_type_validated	209
computer_cable_type	209
is_waterproof_validated	195
is_maximum_screen_size_validated	191
is_number_of_megapixels_validated	189
is_tv_and_monitor_mount_type_validated	187
is_laptop_computer_type_validated	186
is_maximum_load_weight_validated	183
audio_video_cable_type	178
maximum_load_weight	172
accessories_included_error_code	172
is_features_validated	169
contained_battery_type_error_code	168
accessories_included	163
is_headphone_feature_validated	161
operating_system_error_code	158
headset_type	144
headphone_feature	138
is_headset_type_validated	133
tv_and_monitor_mount_type	132
number_of_megapixels_error_code	130
is_audio_video_cable_type_validated	123
cell_phone_case_type_validation_comment	121
compatible_devices_error_code	120
ram_memory_error_code	116
is_video_game_accessory_type_validated	106
video_game_accessory_type	103
storage_media_type	102
is_hard_drive_type_validated	102
is_internal_external_validated	102
computer_keyboard_type	102
is_surveillance_camera_type_validated	101
is_computer_keyboard_type_validated	101
is_monitor_type_validated	100
printing_technology	99
is_home_speaker_and_subwoofer_type_validated	99
is_speaker_location_validated	99
home_speaker_and_subwoofer_type	99
sports_team_error_code	98
number_of_megapixels	94
sports_league_error_code	90
color_category_error_code	86
electronics_carrying_case_type	86
sports_league	83
is_ram_memory_type_validated	83
cell_phone_case_type_error_code	80
laptop_computer_type_error_code	76
is_memory_capacity_validated	76
monitor_type	75
model_name	74
speaker_location	74
screen_size_validation_comment	73
hard_drive_capacity_error_code	71
surveillance_camera_type	68
antenna_type	67
personalizable_error_code	66
personalization_url_error_code	66
is_antenna_type_validated	65
computer_mouse_type	65
is_computer_mouse_type_validated	64
is_printer_and_all-in-one_type_validated	63
is_printing_technology_validated	63
cell_phone_type_error_code	62
cell_phone_service_provider_error_code	61
printer_and_all-in-one_type	60
is_electronics_carrying_case_type_validated	59
is_waterproof_error_code	58
is_portable_error_code	55
is_prop_65_warning_validated	53
is_prop_65_warning_required_validation_comment	53
contains_batteries_validation_comment	52
is_electronics_film_protector_type_validated	52
contained_battery_type_validation_comment	51
tv_and_monitor_mount_type_error_code	51
resolution_error_code	51
prop_65_warning_text_validation_comment	50
inputs_and_outputs_error_code	50
electronics_film_protector_type	48
virtual_assistant	47
is_memory_card_type_validated	46
contains_batteries_error_code	42
is_gps_device_type_validated	41
sports_team	39
maximum_load_weight_error_code	38
surveillance_camera_type_error_code	35
gps_device_type	31
has_warranty_validation_comment	27
compatible_devices_validation_comment	27
speaker_location_error_code	27
compatible_smart_control_systems	26
warranty_text_validation_comment	25
monitor_type_error_code	25
headphone_feature_error_code	24
is_computer_cooling_type_validated	22
energy_guide_label_error_code	20
maximum_screen_size_error_code	20
display_technology_error_code	18
wireless_error_code	18
is_supported_media_formats_validated	17
video_game_platform_error_code	16
video_game_accessory_type_error_code	16
supported_media_formats	16
power_type_validation_comment	15
is_digital_audio_formats_validated	15
assembled_product_dimensions_validation_comment	14
assembled_product_width_validation_comment	13
assembled_product_height_validation_comment	13
video_game_platform_validation_comment	13
gps_device_type_error_code	12
computer_cooling_type_error_code	12
computer_cooling_type	12
digital_audio_formats	12
video_game_accessory_type_validation_comment	11
computer_keyboard_type_error_code	11
processor_type_validation_comment	11
hard_drive_capacity_validation_comment	11
operating_system_validation_comment	11
assembled_product_length_validation_comment	10
computer_cable_type_validation_comment	10
camera_lens_type	10
desktop_computer_type_validation_comment	10
ram_memory_validation_comment	10
headphone_type_error_code	9
power_type_error_code	9
wireless_technology_error_code	9
energy_guide_label	9
inputs_and_outputs_validation_comment	9
focal_length	8
headset_type_validation_comment	8
memory_card_type_error_code	8
headset_type_error_code	8
is_energy_guide_label_required_error_code	8
television_type_error_code	8
home_speaker_and_subwoofer_type_error_code	8
is_recording_time_validated	8
recording_time_error_code	8
computer_cable_type_error_code	7
is_programmable_validated	7
is_has_touchscreen_validated	7
accessories_included_validation_comment	7
is_digital_video_recorder_type_validated	6
is_focal_length_validated	6
is_camera_lens_type_validated	6
digital_video_recorder_type	5
is_digital_camera_type_validated	5
digital_camera_type	5
printing_technology_error_code	5
features_error_code	5
is_portable_validation_comment	5
wireless_validation_comment	5
electronics_film_protector_type_error_code	5
programmable	5
contains_chemicals_validation_comment	4
is_smart_validation_comment	4
electronics_carrying_case_type_error_code	4
printer_and_all-in-one_type_error_code	4
cell_phone_service_provider_validation_comment	4
cell_phone_type_validation_comment	4
has_touchscreen	4
is_radio_signal_type_validated	4
portable_radio_type	4
radio_signal_type	4
is_portable_radio_type_validated	4
has_touchscreen_error_code	4
headphone_type_validation_comment	4
audio_video_cable_type_validation_comment	3
wireless_technology_validation_comment	3
internal_external_error_code	3
hard_drive_type_error_code	3
digital_audio_formats_error_code	3
recordable_media_formats	3
focal_length_error_code	2
desktop_computer_type_error_code	2
programmable_error_code	2
memory_capacity_error_code	2
electronics_film_protector_type_validation_comment	2
sports_league_validation_comment	1
sports_team_validation_comment	1
digital_video_recorder_type_error_code	1
is_waterproof_validation_comment	1
computer_mouse_type_error_code	1
television_type_validation_comment	1
resolution_validation_comment	1
display_technology_validation_comment	1
antenna_type_validation_comment	1
antenna_type_error_code	1
tv_and_monitor_mount_type_validation_comment	1
headphone_feature_validation_comment	1
color_category_validation_comment	1
supported_media_formats_error_code	1
