product_id	85914
item_id	85914
category	85914
ib_category	85914
product_type_group	85914
product_id_type	85914
app_id	85914
tenant_id	85914
last_updated_user_id	85914
item_status	85914
_id	85914
_routing	85914
product_type	85911
is_product_type_validated	85909
product_long_description	85907
supplier_id	85899
is_private_label	85896
priority	85471
initial_created_user_id	85469
brand	85423
supplier_name	83784
correct_product_type	83500
ib_sub_category	82825
error_codes	82788
product_short_description	81937
is_category_validated	79411
correct_category	78269
is_assembly_required	77789
material	76926
manufacturer	76851
supplier_country_code	74683
color_category	73964
shelf_description	69676
is_product_short_description_validated	68773
is_brand_validated	68666
is_assembled_product_length_validated	68655
is_assembled_product_width_validated	68655
is_assembled_product_height_validated	68655
is_material_validated	68653
is_product_name_validated	68646
is_assembly_required_validated	68597
is_color_category_validated	68452
is_product_long_description_validated	68421
is_sports_team_validated	68249
is_occasion_validated	68221
is_sports_league_validated	68195
is_age_group_validated	68105
assembled_product_width	66293
assembled_product_length	66017
assembled_product_weight	64491
size	64097
assembled_product_weight_validated	63759
assembled_product_height	62572
age_group	59843
recommended_room	56798
wpid	55823
color_category_validation_comment	50209
home_decor_style	47307
is_set	44044
is_assembly_required_validation_comment	42548
is_set_validated	39963
is_theme_validated	38771
theme	37456
is_home_decor_style_validated	37099
recommended_use	35981
age_group_validation_comment	34276
shape	32703
is_personalizable_validated	32663
product_long_description_validation_comment	31708
product_long_description_error_code	31114
is_recommended_room_validated	29901
assembled_product_weight_validation_comment	29649
assembled_product_height_validation_comment	26384
is_framed_validated	26208
pattern	24249
assembled_product_width_validation_comment	23880
framed	23133
assembled_product_length_validation_comment	22761
rug_size	22470
is_recommended_location_validated	22333
product_type_validation_comment	22307
occasion	20083
theme_validation_comment	16271
is_gifts_by_recipient_validated	15865
assembled_product_height_error_code	15749
is_set_validation_comment	15659
is_shape_validated	15329
assembled_product_weight_error_code	15106
recommended_room_validation_comment	14903
brand_validation_comment	14213
age_group_error_code	14077
is_disposable_validated	13955
is_character_validated	13933
recommended_location	13432
is_rug_size_validated	12805
assembled_product_length_error_code	12803
product_type_error_code	12408
is_rug_style_validated	12374
assembled_product_width_error_code	12274
is_manufacturer_validated	11919
product_short_description_error_code	11197
disposable	10816
is_machine_washable_validated	10081
rug_style	9699
is_pattern_validated	9373
framed_validation_comment	8899
shape_validation_comment	8068
disposable_validation_comment	7856
is_size_validated	7755
home_decor_style_validation_comment	7146
recommended_location_validation_comment	6740
product_name_error_code	6641
material_validation_comment	6252
is_recommended_use_validated	6117
machine_washable_error_code	5966
is_shelf_description_validated	5859
product_name_validation_comment	5793
is_bed_size_validated	5435
bed_size	5415
is_assembled_product_weight_validated	5405
color	5368
home_decor_style_error_code	5362
recommended_location_error_code	5342
is_floor_mat_and_doormat_type_validated	5284
is_tableware_set_type_validated	4938
is_color_validated	4898
is_piece_count_validated	4766
cleaning_care_and_maintenance	4383
occasion_validation_comment	4322
is_alcohol_class_and_type_validated	4282
personalizable	4250
fill_material	4245
is_subject_validated	4100
material_error_code	4087
is_inflatable_validated	4044
is_ib_window_treatment_sheerness_validated	3974
is_bedding_set_type_validated	3956
is_curtain_and_valance_type_validated	3907
is_decorative_pillow_type_validated	3769
is_bed_pillow_size_validated	3727
rug_size_validation_comment	3665
is_candle_type_validated	3464
is_unscented_validated	3464
color_validation_comment	3354
is_towel_and_washcloth_type_validated	3322
is_wall_light_and_sconce_type_validated	3308
is_weight_validated	3294
is_furniture_type_validated	3227
is_slipcover_type_validated	3218
is_plaque_and_sign_type_validated	3210
is_fill_material_validated	3206
is_nonstick_validated	3199
is_induction_safe_validated	3199
is_bed_sheet_type_validated	3165
is_mirror_type_validated	3164
is_food_storage_jar_and_container_type_validated	3113
is_window_blind_and_shade_type_validated	3100
is_pillowcase_and_pillow_sham_type_validated	3087
rug_size_error_code	3075
is_reusable_lunch_bag_and_box_type_validated	3065
is_comforter_and_duvet_type_validated	3064
is_shower_curtain_and_liner_type_validated	3058
is_mount_type_validated	3011
is_curtain_rod_and_rod_set_type_validated	3000
is_compatible_smart_control_systems_validated	2974
is_kitchen_knife_and_cutlery_set_type_validated	2962
is_seating_cushion_type_validated	2958
theme_error_code	2938
is_sleep_position_validated	2932
is_refrigerator_type_validated	2917
color_category_error_code	2903
is_has_lights_validated	2897
is_vacuum_cleaner_type_validated	2872
is_bagless_validated	2864
is_cordless_validated	2864
is_bedspread_and_coverlet_type_validated	2863
is_waterproof_validated	2847
is_plant_category_validated	2841
is_air_conditioner_type_validated	2827
is_has_motion_detector_validated	2820
is_tablecloth_and_table_runner_type_validated	2807
is_wine_rack_type_validated	2806
is_cooking_range_type_validated	2804
is_freezer_type_validated	2804
sports_league	2803
is_microwave_oven_type_validated	2800
size_error_code	2799
is_clothes_dryer_type_validated	2790
is_washing_machine_type_validated	2789
is_wall_oven_type_validated	2789
is_dishwasher_type_validated	2787
model	2704
is_collection_validated	2527
subject	2504
floor_mat_and_doormat_type	2442
sports_team	2365
is_assembly_required_error_code	2317
bed_pillow_size	2258
recommended_room_error_code	2209
manufacturer_error_code	1945
is_weaving_technique_validated	1898
is_cleaning_care_and_maintenance_validated	1894
is_pile_thickness_validated	1894
is_frame_material_validated	1873
is_frame_color_validated	1873
is_orientation_validated	1873
is_artist_validated	1873
is_art_type_validated	1873
disposable_error_code	1853
shelf_description_validation_comment	1790
collection	1786
rug_style_error_code	1784
personalizable_validation_comment	1773
frame_material	1729
manufacturer_validation_comment	1723
art_type_error_code	1723
artist_error_code	1704
frame_color_error_code	1700
product_short_description_validation_comment	1482
collection_error_code	1439
bedding_set_type	1401
pile_thickness_error_code	1388
machine_washable	1359
features	1272
pattern_validation_comment	1218
brand_error_code	1211
inflatable	1112
personalizable_error_code	1089
gifts_by_recipient_error_code	1067
weaving_technique	1059
orientation	1043
pattern_error_code	999
subject_error_code	998
curtain_and_valance_type	990
decorative_pillow_type	932
rug_style_validation_comment	908
character	873
bed_sheet_type	867
ib_window_treatment_sheerness	809
seating_cushion_type	797
cleaning_care_and_maintenance_error_code	756
orientation_error_code	754
mount_type	635
weaving_technique_error_code	623
unscented	619
candle_type	598
comforter_and_duvet_type	578
gifts_by_recipient	538
plaque_and_sign_type	527
curtain_panel_style	522
wall_light_and_sconce_type	491
furniture_type	483
cleaning_care_and_maintenance_validation_comment	474
towel_and_washcloth_type	473
shape_error_code	467
character_error_code	458
size_validation_comment	405
ib_window_treatment_sheerness_error_code	404
gifts_by_recipient_validation_comment	401
inflatable_validation_comment	396
mirror_type	384
sports_league_validation_comment	348
subject_validation_comment	340
alcohol_class_and_type	339
piece_count	339
pillowcase_and_pillow_sham_type	328
bed_size_validation_comment	314
nonstick	299
curtain_and_valance_type_validation_comment	289
cordless	287
food_storage_jar_and_container_type	281
window_blind_and_shade_type	276
is_curtain_panel_style_validated	272
is_waterproof	264
reusable_lunch_bag_and_box_type	264
shower_curtain_and_liner_type	260
bed_size_error_code	246
pile_thickness	240
plaque_and_sign_type_validation_comment	227
weight	225
induction_safe_error_code	219
mirror_type_validation_comment	199
curtain_and_valance_type_error_code	190
slipcover_type	173
tableware_set_type	169
induction_safe	164
framed_error_code	157
kitchen_knife_and_cutlery_set_type	151
nonstick_error_code	150
curtain_rod_and_rod_set_type	149
bed_pillow_size_error_code	134
color_error_code	123
refrigerator_type	122
has_lights	119
is_model_validated	113
reusable_lunch_bag_and_box_type_validation_comment	102
model_validation_comment	102
character_validation_comment	89
vacuum_cleaner_type	85
decorative_pillow_type_error_code	81
recommended_use_validation_comment	76
fill_material_error_code	75
bedspread_and_coverlet_type	73
is_window_treatment_style_validated	67
food_storage_jar_and_container_type_error_code	64
reusable_lunch_bag_and_box_type_error_code	63
inflatable_error_code	62
window_treatment_style	62
plant_category	60
bedding_set_type_error_code	60
category_error_code	55
sleep_position	47
frame_color	47
orientation_validation_comment	47
curtain_rod_and_rod_set_type_error_code	46
has_lights_validation_comment	43
air_conditioner_type	41
recommended_use_error_code	40
is_features_validated	39
pillowcase_and_pillow_sham_type_validation_comment	39
plaque_and_sign_type_error_code	39
nonstick_validation_comment	38
sleep_position_error_code	38
bed_pillow_size_validation_comment	38
is_set_error_code	37
curtain_rod_and_rod_set_type_validation_comment	37
towel_and_washcloth_type_error_code	36
unscented_error_code	35
candle_type_error_code	34
tablecloth_and_table_runner_type	34
weight_validation_comment	34
mirror_type_error_code	33
bedding_set_type_validation_comment	33
is_scent_validated	32
is_scent_family_validated	32
scent	32
food_storage_jar_and_container_type_validation_comment	32
bagless	31
artist	31
refrigerator_type_error_code	30
induction_safe_validation_comment	29
fill_material_validation_comment	29
bagless_error_code	28
slipcover_type_error_code	28
kitchen_knife_and_cutlery_set_type_error_code	26
frame_color_validation_comment	25
comforter_and_duvet_type_error_code	25
sports_team_validation_comment	24
towel_and_washcloth_type_validation_comment	24
frame_material_error_code	24
machine_washable_validation_comment	24
curtain_panel_style_validation_comment	24
air_conditioner_type_validation_comment	23
freezer_type	22
pile_thickness_validation_comment	22
ib_window_treatment_sheerness_validation_comment	22
cordless_error_code	21
floor_mat_and_doormat_type_error_code	19
cooking_range_type	19
is_picture_frame_type_validated	19
window_treatment_style_validation_comment	17
has_motion_detector_error_code	16
shelf_description_error_code	16
decorative_pillow_type_validation_comment	16
power_type	14
category_validation_comment	14
additional_image_inputs	14
shower_curtain_and_liner_type_error_code	14
mount_type_error_code	14
curtain_panel_style_error_code	14
microwave_oven_type_error_code	14
tableware_set_type_error_code	13
wine_rack_type	13
is_animal_type_validated	13
picture_frame_type_error_code	13
tablecloth_and_table_runner_type_error_code	12
compatible_smart_control_systems_error_code	12
art_type	11
features_error_code	11
is_batteries_required_validated	11
is_display_technology_validated	11
is_clock_type_validated	11
is_battery_size_validated	11
is_waterproof_error_code	11
batteries_required	10
weight_error_code	9
display_technology	9
clock_type	9
battery_size	9
refrigerator_type_validation_comment	9
collection_validation_comment	9
kitchen_knife_and_cutlery_set_type_validation_comment	9
furniture_type_error_code	8
animal_type_error_code	8
is_power_type_validated	8
is_candle_holder_type_validated	8
piece_count_validation_comment	8
piece_count_error_code	8
alcohol_class_and_type_error_code	7
pillowcase_and_pillow_sham_type_error_code	7
microwave_oven_type	7
candle_holder_type	7
comforter_and_duvet_type_validation_comment	7
is_plant_name_validated	6
scent_family	6
picture_frame_type	6
sleep_position_validation_comment	5
display_technology_error_code	5
washing_machine_type	5
candle_holder_type_validation_comment	5
seating_cushion_type_error_code	4
washing_machine_type_error_code	4
has_motion_detector	4
is_diameter_validated	4
clothes_dryer_type_error_code	4
wall_oven_type	4
image_count	4
diameter_error_code	4
is_clock_dial_number_type_validated	4
plant_name_error_code	3
vacuum_cleaner_type_error_code	3
candle_type_validation_comment	3
bed_sheet_type_error_code	3
vacuum_cleaner_type_validation_comment	3
mount_type_validation_comment	3
sports_team_error_code	3
clock_dial_number_type_error_code	3
unscented_validation_comment	2
wine_rack_type_error_code	2
active_status	2
tableware_set_type_validation_comment	2
wall_light_and_sconce_type_error_code	2
sports_league_error_code	2
clock_type_error_code	2
animal_type	2
clock_dial_number_type	2
dishwasher_type_error_code	2
bagless_validation_comment	1
cordless_validation_comment	1
diameter	1
shower_curtain_and_liner_type_validation_comment	1
compatible_smart_control_systems	1
clothes_dryer_type	1
air_conditioner_type_error_code	1
is_vegetable_type_validated	1
is_fruit_type_validated	1
vegetable_type_error_code	1
fruit_type_error_code	1
alcohol_class_and_type_validation_comment	1
wall_oven_type_error_code	1
wall_oven_type_validation_comment	1
weaving_technique_validation_comment	1
animal_type_validation_comment	1
washing_machine_type_validation_comment	1
window_treatment_style_error_code	1
candle_holder_type_error_code	1
microwave_oven_type_validation_comment	1
furniture_type_validation_comment	1
battery_size_validation_comment	1
batteries_required_validation_comment	1
display_technology_validation_comment	1
plant_category_error_code	0
plant_height	0
is_plant_height_validated	0
plant_name	0
has_motion_detector_validation_comment	0
wine_rack_type_validation_comment	0
tree_type_error_code	0
is_tree_type_validated	0
plant_height_error_code	0
pass_fail	0
yes	0
total_errors	0
no	0
total	0
abort	0
pass_or_failed_validation	0
num_attributes_passed	0
num_attributes_failed	0
num_attributes_aborted	0
wall_light_and_sconce_type_validation_comment	0
bed_sheet_type_validation_comment	0
is_geographic_globe_type_validated	0
form	0
power_type_error_code	0
battery_size_error_code	0
batteries_required_error_code	0
artist_validation_comment	0
geographic_globe_type	0
dishwasher_type	0
seating_cushion_type_validation_comment	0
occasion_error_code	0
