product_id	72743
item_id	72743
category	72743
product_type	72743
product_long_description	72743
ib_category	72743
product_type_group	72743
product_id_type	72743
app_id	72743
tenant_id	72743
item_status	72743
_id	72743
_routing	72743
is_product_type_validated	72735
supplier_id	72731
is_private_label	72729
brand	72692
priority	72633
ib_sub_category	72590
manufacturer	71295
product_short_description	71196
correct_product_type	71071
contains_batteries	69409
contains_aerosol	69409
contains_chemicals	69409
is_prop_65_warning_required	68658
has_state_restrictions	68596
supplier_name	66736
is_product_short_description_validated	62669
is_manufacturer_validated	62643
is_vehicle_type_validated	62634
is_product_name_validated	62624
is_brand_validated	62466
wpid	62444
is_product_long_description_validated	62240
supplier_country_code	60686
is_vehicle_model_validated	59330
is_vehicle_make_validated	59330
price_per_unit_uom	56628
ppu_quantity_of_units	56480
vehicle_type_error_code	53171
vehicle_model_error_code	52211
prop_65_warning_text	47629
vehicle_make_error_code	44598
product_short_description_error_code	43265
is_manufacturer_part_number_validated	42122
manufacturer_part_number_error_code	41878
is_powered_validated	40444
is_power_type_validated	40444
is_powered_error_code	39902
power_type_error_code	39893
product_long_description_error_code	39453
product_short_description_validation_comment	28271
product_name_validation_comment	26693
product_long_description_validation_comment	25536
has_warranty	22411
warranty_text	21655
product_type_error_code	16598
vehicle_rim	15444
assembled_product_length	14718
vehicle_make	11050
is_material_validated	10389
is_vehicle_rim_validated	9765
is_diameter_validated	9765
material_error_code	9751
vehicle_type	8663
error_codes	8303
brand_error_code	7003
product_name_error_code	6889
diameter_error_code	6635
diameter	5257
is_tire_speed_rating_validated	4851
is_wheel_diameter_validated	4851
is_tire_size_validated	4849
is_tire_width_validated	4845
is_tire_aspect_ratio_validated	4825
is_tire_load_index_validated	4792
is_tire_terrain_validated	4699
is_tire_treadwear_rating_validated	4699
maximum_inflation_pressure_validated	4693
is_tire_season_validated	4681
is_overall_diameter_validated	4485
wheel_diameter	4139
tire_size	3867
vehicle_model	3710
category_validation_comment	3683
is_tire_type_validated	3622
assembled_product_weight_uom_validation	3589
assembled_product_weight_validated	3585
size	3433
is_has_warranty_validated	3361
is_warranty_text_validated	3361
is_piece_count_validated	3260
tire_aspect_ratio	3070
tire_speed_rating	3042
tire_load_index	2995
material	2734
tire_width	2724
is_size_validated	2695
tire_season	2610
active_status	2507
correct_category	2400
vehicle_rim_error_code	2235
tire_terrain_error_code	2137
maximum_inflation_pressure_error_code	2099
brand_validation_comment	2086
is_category_validated	2079
tire_treadwear_rating_error_code	1946
manufacturer_validation_comment	1846
vehicle_type_validation_comment	1819
vehicle_make_validation_comment	1667
vehicle_model_validation_comment	1652
is_assembled_product_dimensions_validated	1581
size_validation_comment	1557
tire_type	1514
size_error_code	1397
is_powered	1396
overall_diameter	1385
tire_width_error_code	1296
tire_treadwear_rating	1248
power_type	1211
fuel_type	1147
maximum_inflation_pressure	1021
tire_season_error_code	1008
tire_terrain	958
piece_count_error_code	939
is_beam_angle_validated	914
is_light_bulb_type_validated	914
is_beam_spread_validated	914
is_candle_power_validated	914
assembled_product_weight_uom_error_code	909
beam_spread_error_code	908
beam_angle_error_code	908
candle_power_error_code	900
assembled_product_weight	868
tire_type_error_code	842
assembled_product_weight_error_code	840
light_bulb_type_error_code	839
recommended_use	762
is_for_automotive_use_validated	731
for_automotive_use_error_code	729
assembled_product_weight_uom	728
has_warranty_error_code	707
warranty_text_error_code	706
is_cold_crank_amp_validated	656
tire_speed_rating_error_code	553
cold_crank_amp_error_code	546
piece_count	531
tire_load_index_error_code	519
tire_aspect_ratio_error_code	487
manufacturer_error_code	470
product_type_validation_comment	450
manufacturer_part_number	389
is_assembled_product_weight_validated	364
wheel_diameter_error_code	325
is_assembled_product_length_validated	281
image_count	279
vehicle_category_validation_comment	261
is_sports_league_validated	246
contained_battery_type	233
assembled_product_dimensions_error_code	213
additional_image_inputs	209
sports_league_error_code	206
assembled_product_length_error_code	205
overall_diameter_validation_comment	204
tire_treadwear_rating_validation_comment	174
is_image_rearrange_required	164
wheel_diameter_validation_comment	156
is_powered_validation_comment	154
cold_crank_amp	150
manufacturer_part_number_validation_comment	138
power_type_validation_comment	131
is_color_category_validated	125
fluid_ounces	106
tire_season_validation_comment	103
color_category	88
light_bulb_type	85
vehicle_category	79
is_ppu_quantity_of_units_validated	64
beam_spread	63
beam_angle	63
recommended_use_error_code	63
is_price_per_unit_uom_validated	63
is_recommended_use_validated	63
maximum_inflation_pressure_validation_comment	62
is_flash_point_validated	62
is_fluid_ounces_validated	62
is_fuel_type_validated	62
candle_power	61
fuel_type_error_code	61
flash_point_error_code	55
tire_speed_rating_validation_comment	54
tire_width_validation_comment	53
tire_size_validation_comment	52
is_hitch_class_validated	50
tire_aspect_ratio_validation_comment	48
flash_point	47
assembled_product_dimensions	46
hitch_class_error_code	44
fluid_ounces_error_code	38
tire_terrain_validation_comment	37
tire_load_index_validation_comment	35
overall_diameter_error_code	34
is_vehicle_category_validated	21
tire_size_error_code	19
vehicle_category_error_code	18
material_validation_comment	15
assembled_product_length_validation_comment	12
price_per_unit_uom_error_code	6
hitch_class	6
is_number_of_pieces_displayed_validated	6
ppu_quantity_of_units_error_code	5
number_of_pieces_displayed_error_code	5
for_automotive_use	4
warranty_text_validation_comment	3
has_warranty_validation_comment	3
sports_league_validation_comment	3
diameter_validation_comment	3
vehicle_rim_validation_comment	3
assembled_product_weight_validation_comment	2
tire_type_validation_comment	2
for_automotive_use_validation_comment	2
sports_league	2
is_prop_65_warning_text_validated	2
is_contained_battery_type_validated	2
is_has_state_restrictions_validated	2
flash_point_validation_comment	1
is_prop_65_warning_required_validated	1
is_contains_batteries_validated	1
hitch_class_validation_comment	1
is_contains_aerosol_validated	1
is_prop_65_warning_required_validation_comment	1
contains_batteries_validation_comment	1
contained_battery_type_validation_comment	1
has_state_restrictions_validation_comment	1
pass_fail	0
yes	0
total_errors	0
no	0
total	0
abort	0
pass_or_failed_validation	0
num_attributes_passed	0
num_attributes_failed	0
num_attributes_aborted	0
number_of_pieces_displayed	0
